{
  "vocab_size": 279,
  "chord_to_id": {
    "<PAD>": 0,
    "<START>": 1,
    "<END>": 2,
    "<UNK>": 3,
    "A": 4,
    "A#": 5,
    "A#13": 6,
    "A#6": 7,
    "A#7": 8,
    "A#7#9": 9,
    "A#7b9": 10,
    "A#9": 11,
    "A#add9": 12,
    "A#m": 13,
    "A#m11": 14,
    "A#m13": 15,
    "A#m6": 16,
    "A#m7": 17,
    "A#m9": 18,
    "A#maj13": 19,
    "A#maj7": 20,
    "A#maj7#11": 21,
    "A#maj9": 22,
    "A#msus2": 23,
    "A#msus4": 24,
    "A#sus2": 25,
    "A#sus4": 26,
    "A13": 27,
    "A6": 28,
    "A7": 29,
    "A7#9": 30,
    "A7b9": 31,
    "A7sus4": 32,
    "A9": 33,
    "Aadd9": 34,
    "Am": 35,
    "Am11": 36,
    "Am13": 37,
    "Am6": 38,
    "Am7": 39,
    "Am9": 40,
    "Amadd9": 41,
    "Amaj13": 42,
    "Amaj7": 43,
    "Amaj7#11": 44,
    "Amaj9": 45,
    "Amsus2": 46,
    "Amsus4": 47,
    "Asus2": 48,
    "Asus4": 49,
    "B": 50,
    "B13": 51,
    "B6": 52,
    "B7": 53,
    "B7#9": 54,
    "B7b9": 55,
    "B7sus4": 56,
    "B9": 57,
    "Badd9": 58,
    "Bm": 59,
    "Bm11": 60,
    "Bm13": 61,
    "Bm6": 62,
    "Bm7": 63,
    "Bm9": 64,
    "Bmadd9": 65,
    "Bmaj13": 66,
    "Bmaj7": 67,
    "Bmaj7#11": 68,
    "Bmaj9": 69,
    "Bmsus4": 70,
    "Bsus2": 71,
    "Bsus4": 72,
    "C": 73,
    "C#": 74,
    "C#13": 75,
    "C#6": 76,
    "C#7": 77,
    "C#7#9": 78,
    "C#7b9": 79,
    "C#7sus4": 80,
    "C#9": 81,
    "C#add9": 82,
    "C#m": 83,
    "C#m13": 84,
    "C#m6": 85,
    "C#m7": 86,
    "C#m9": 87,
    "C#madd9": 88,
    "C#maj13": 89,
    "C#maj7": 90,
    "C#maj7#11": 91,
    "C#maj9": 92,
    "C#msus2": 93,
    "C#msus4": 94,
    "C#sus2": 95,
    "C#sus4": 96,
    "C13": 97,
    "C6": 98,
    "C7": 99,
    "C7#9": 100,
    "C7b9": 101,
    "C7sus4": 102,
    "C9": 103,
    "Cadd9": 104,
    "Cm": 105,
    "Cm11": 106,
    "Cm13": 107,
    "Cm6": 108,
    "Cm7": 109,
    "Cm9": 110,
    "Cmadd9": 111,
    "Cmaj13": 112,
    "Cmaj7": 113,
    "Cmaj9": 114,
    "Cmsus2": 115,
    "Cmsus4": 116,
    "Csus2": 117,
    "Csus4": 118,
    "D": 119,
    "D#": 120,
    "D#13": 121,
    "D#6": 122,
    "D#7": 123,
    "D#7#9": 124,
    "D#7sus4": 125,
    "D#9": 126,
    "D#add9": 127,
    "D#m": 128,
    "D#m11": 129,
    "D#m13": 130,
    "D#m6": 131,
    "D#m7": 132,
    "D#m9": 133,
    "D#madd9": 134,
    "D#maj13": 135,
    "D#maj7": 136,
    "D#maj7#11": 137,
    "D#maj9": 138,
    "D#msus2": 139,
    "D#msus4": 140,
    "D#sus2": 141,
    "D#sus4": 142,
    "D13": 143,
    "D6": 144,
    "D7": 145,
    "D7#9": 146,
    "D7b9": 147,
    "D7sus4": 148,
    "D9": 149,
    "Dadd9": 150,
    "Dm": 151,
    "Dm11": 152,
    "Dm13": 153,
    "Dm6": 154,
    "Dm7": 155,
    "Dm9": 156,
    "Dmadd9": 157,
    "Dmaj13": 158,
    "Dmaj7": 159,
    "Dmaj7#11": 160,
    "Dmaj9": 161,
    "Dmsus2": 162,
    "Dmsus4": 163,
    "Dsus2": 164,
    "Dsus4": 165,
    "E": 166,
    "E13": 167,
    "E6": 168,
    "E7": 169,
    "E7sus4": 170,
    "E9": 171,
    "Eadd9": 172,
    "Em": 173,
    "Em11": 174,
    "Em13": 175,
    "Em6": 176,
    "Em7": 177,
    "Em9": 178,
    "Emadd9": 179,
    "Emaj13": 180,
    "Emaj7": 181,
    "Emaj7#11": 182,
    "Emaj9": 183,
    "Emsus4": 184,
    "Esus2": 185,
    "Esus4": 186,
    "F": 187,
    "F#": 188,
    "F#13": 189,
    "F#6": 190,
    "F#7": 191,
    "F#7#9": 192,
    "F#7b9": 193,
    "F#7sus4": 194,
    "F#add9": 195,
    "F#m": 196,
    "F#m13": 197,
    "F#m7": 198,
    "F#m9": 199,
    "F#madd9": 200,
    "F#maj13": 201,
    "F#maj7": 202,
    "F#maj7#11": 203,
    "F#maj9": 204,
    "F#msus2": 205,
    "F#msus4": 206,
    "F#sus2": 207,
    "F#sus4": 208,
    "F13": 209,
    "F6": 210,
    "F7": 211,
    "F7b9": 212,
    "F7sus4": 213,
    "F9": 214,
    "Fadd9": 215,
    "Fm": 216,
    "Fm11": 217,
    "Fm13": 218,
    "Fm6": 219,
    "Fm7": 220,
    "Fm9": 221,
    "Fmadd9": 222,
    "Fmaj13": 223,
    "Fmaj7": 224,
    "Fmaj7#11": 225,
    "Fmaj9": 226,
    "Fmsus2": 227,
    "Fmsus4": 228,
    "Fsus2": 229,
    "Fsus4": 230,
    "G": 231,
    "G#": 232,
    "G#13": 233,
    "G#6": 234,
    "G#7": 235,
    "G#7#9": 236,
    "G#7b9": 237,
    "G#7sus4": 238,
    "G#9": 239,
    "G#add9": 240,
    "G#m": 241,
    "G#m11": 242,
    "G#m13": 243,
    "G#m6": 244,
    "G#m7": 245,
    "G#m9": 246,
    "G#madd9": 247,
    "G#maj13": 248,
    "G#maj7": 249,
    "G#maj7#11": 250,
    "G#maj9": 251,
    "G#msus2": 252,
    "G#msus4": 253,
    "G#sus2": 254,
    "G#sus4": 255,
    "G13": 256,
    "G6": 257,
    "G7": 258,
    "G7#9": 259,
    "G7b9": 260,
    "G7sus4": 261,
    "G9": 262,
    "Gadd9": 263,
    "Gm": 264,
    "Gm11": 265,
    "Gm13": 266,
    "Gm6": 267,
    "Gm7": 268,
    "Gm9": 269,
    "Gmadd9": 270,
    "Gmaj13": 271,
    "Gmaj7": 272,
    "Gmaj7#11": 273,
    "Gmaj9": 274,
    "Gmsus2": 275,
    "Gmsus4": 276,
    "Gsus2": 277,
    "Gsus4": 278
  },
  "id_to_chord": {
    "0": "<PAD>",
    "1": "<START>",
    "2": "<END>",
    "3": "<UNK>",
    "4": "A",
    "5": "A#",
    "6": "A#13",
    "7": "A#6",
    "8": "A#7",
    "9": "A#7#9",
    "10": "A#7b9",
    "11": "A#9",
    "12": "A#add9",
    "13": "A#m",
    "14": "A#m11",
    "15": "A#m13",
    "16": "A#m6",
    "17": "A#m7",
    "18": "A#m9",
    "19": "A#maj13",
    "20": "A#maj7",
    "21": "A#maj7#11",
    "22": "A#maj9",
    "23": "A#msus2",
    "24": "A#msus4",
    "25": "A#sus2",
    "26": "A#sus4",
    "27": "A13",
    "28": "A6",
    "29": "A7",
    "30": "A7#9",
    "31": "A7b9",
    "32": "A7sus4",
    "33": "A9",
    "34": "Aadd9",
    "35": "Am",
    "36": "Am11",
    "37": "Am13",
    "38": "Am6",
    "39": "Am7",
    "40": "Am9",
    "41": "Amadd9",
    "42": "Amaj13",
    "43": "Amaj7",
    "44": "Amaj7#11",
    "45": "Amaj9",
    "46": "Amsus2",
    "47": "Amsus4",
    "48": "Asus2",
    "49": "Asus4",
    "50": "B",
    "51": "B13",
    "52": "B6",
    "53": "B7",
    "54": "B7#9",
    "55": "B7b9",
    "56": "B7sus4",
    "57": "B9",
    "58": "Badd9",
    "59": "Bm",
    "60": "Bm11",
    "61": "Bm13",
    "62": "Bm6",
    "63": "Bm7",
    "64": "Bm9",
    "65": "Bmadd9",
    "66": "Bmaj13",
    "67": "Bmaj7",
    "68": "Bmaj7#11",
    "69": "Bmaj9",
    "70": "Bmsus4",
    "71": "Bsus2",
    "72": "Bsus4",
    "73": "C",
    "74": "C#",
    "75": "C#13",
    "76": "C#6",
    "77": "C#7",
    "78": "C#7#9",
    "79": "C#7b9",
    "80": "C#7sus4",
    "81": "C#9",
    "82": "C#add9",
    "83": "C#m",
    "84": "C#m13",
    "85": "C#m6",
    "86": "C#m7",
    "87": "C#m9",
    "88": "C#madd9",
    "89": "C#maj13",
    "90": "C#maj7",
    "91": "C#maj7#11",
    "92": "C#maj9",
    "93": "C#msus2",
    "94": "C#msus4",
    "95": "C#sus2",
    "96": "C#sus4",
    "97": "C13",
    "98": "C6",
    "99": "C7",
    "100": "C7#9",
    "101": "C7b9",
    "102": "C7sus4",
    "103": "C9",
    "104": "Cadd9",
    "105": "Cm",
    "106": "Cm11",
    "107": "Cm13",
    "108": "Cm6",
    "109": "Cm7",
    "110": "Cm9",
    "111": "Cmadd9",
    "112": "Cmaj13",
    "113": "Cmaj7",
    "114": "Cmaj9",
    "115": "Cmsus2",
    "116": "Cmsus4",
    "117": "Csus2",
    "118": "Csus4",
    "119": "D",
    "120": "D#",
    "121": "D#13",
    "122": "D#6",
    "123": "D#7",
    "124": "D#7#9",
    "125": "D#7sus4",
    "126": "D#9",
    "127": "D#add9",
    "128": "D#m",
    "129": "D#m11",
    "130": "D#m13",
    "131": "D#m6",
    "132": "D#m7",
    "133": "D#m9",
    "134": "D#madd9",
    "135": "D#maj13",
    "136": "D#maj7",
    "137": "D#maj7#11",
    "138": "D#maj9",
    "139": "D#msus2",
    "140": "D#msus4",
    "141": "D#sus2",
    "142": "D#sus4",
    "143": "D13",
    "144": "D6",
    "145": "D7",
    "146": "D7#9",
    "147": "D7b9",
    "148": "D7sus4",
    "149": "D9",
    "150": "Dadd9",
    "151": "Dm",
    "152": "Dm11",
    "153": "Dm13",
    "154": "Dm6",
    "155": "Dm7",
    "156": "Dm9",
    "157": "Dmadd9",
    "158": "Dmaj13",
    "159": "Dmaj7",
    "160": "Dmaj7#11",
    "161": "Dmaj9",
    "162": "Dmsus2",
    "163": "Dmsus4",
    "164": "Dsus2",
    "165": "Dsus4",
    "166": "E",
    "167": "E13",
    "168": "E6",
    "169": "E7",
    "170": "E7sus4",
    "171": "E9",
    "172": "Eadd9",
    "173": "Em",
    "174": "Em11",
    "175": "Em13",
    "176": "Em6",
    "177": "Em7",
    "178": "Em9",
    "179": "Emadd9",
    "180": "Emaj13",
    "181": "Emaj7",
    "182": "Emaj7#11",
    "183": "Emaj9",
    "184": "Emsus4",
    "185": "Esus2",
    "186": "Esus4",
    "187": "F",
    "188": "F#",
    "189": "F#13",
    "190": "F#6",
    "191": "F#7",
    "192": "F#7#9",
    "193": "F#7b9",
    "194": "F#7sus4",
    "195": "F#add9",
    "196": "F#m",
    "197": "F#m13",
    "198": "F#m7",
    "199": "F#m9",
    "200": "F#madd9",
    "201": "F#maj13",
    "202": "F#maj7",
    "203": "F#maj7#11",
    "204": "F#maj9",
    "205": "F#msus2",
    "206": "F#msus4",
    "207": "F#sus2",
    "208": "F#sus4",
    "209": "F13",
    "210": "F6",
    "211": "F7",
    "212": "F7b9",
    "213": "F7sus4",
    "214": "F9",
    "215": "Fadd9",
    "216": "Fm",
    "217": "Fm11",
    "218": "Fm13",
    "219": "Fm6",
    "220": "Fm7",
    "221": "Fm9",
    "222": "Fmadd9",
    "223": "Fmaj13",
    "224": "Fmaj7",
    "225": "Fmaj7#11",
    "226": "Fmaj9",
    "227": "Fmsus2",
    "228": "Fmsus4",
    "229": "Fsus2",
    "230": "Fsus4",
    "231": "G",
    "232": "G#",
    "233": "G#13",
    "234": "G#6",
    "235": "G#7",
    "236": "G#7#9",
    "237": "G#7b9",
    "238": "G#7sus4",
    "239": "G#9",
    "240": "G#add9",
    "241": "G#m",
    "242": "G#m11",
    "243": "G#m13",
    "244": "G#m6",
    "245": "G#m7",
    "246": "G#m9",
    "247": "G#madd9",
    "248": "G#maj13",
    "249": "G#maj7",
    "250": "G#maj7#11",
    "251": "G#maj9",
    "252": "G#msus2",
    "253": "G#msus4",
    "254": "G#sus2",
    "255": "G#sus4",
    "256": "G13",
    "257": "G6",
    "258": "G7",
    "259": "G7#9",
    "260": "G7b9",
    "261": "G7sus4",
    "262": "G9",
    "263": "Gadd9",
    "264": "Gm",
    "265": "Gm11",
    "266": "Gm13",
    "267": "Gm6",
    "268": "Gm7",
    "269": "Gm9",
    "270": "Gmadd9",
    "271": "Gmaj13",
    "272": "Gmaj7",
    "273": "Gmaj7#11",
    "274": "Gmaj9",
    "275": "Gmsus2",
    "276": "Gmsus4",
    "277": "Gsus2",
    "278": "Gsus4"
  },
  "special_tokens": {
    "pad": "<PAD>",
    "start": "<START>",
    "end": "<END>",
    "unk": "<UNK>"
  }
}