{"format":"layers-model","generatedBy":"keras v3.10.0","convertedBy":"TensorFlow.js Converter v4.22.0","modelTopology":{"keras_version":"3.10.0","backend":"tensorflow","model_config":{"class_name":"Functional","config":{"name":"chord_progression_lstm","trainable":true,"layers":[{"class_name":"InputLayer","config":{"dtype":"int32","sparse":false,"ragged":false,"name":"genre_input","inputShape":[1]},"name":"genre_input","inbound_nodes":[]},{"class_name":"InputLayer","config":{"dtype":"int32","sparse":false,"ragged":false,"name":"mood_input","inputShape":[1]},"name":"mood_input","inbound_nodes":[]},{"class_name":"InputLayer","config":{"dtype":"int32","sparse":false,"ragged":false,"name":"key_input","inputShape":[1]},"name":"key_input","inbound_nodes":[]},{"class_name":"InputLayer","config":{"dtype":"int32","sparse":false,"ragged":false,"name":"scale_type_input","inputShape":[1]},"name":"scale_type_input","inbound_nodes":[]},{"class_name":"Embedding","config":{"name":"genre_embedding","trainable":true,"dtype":{"module":"keras","class_name":"DTypePolicy","config":{"name":"float32"},"registered_name":null},"input_dim":8,"output_dim":16,"embeddings_initializer":{"module":"keras.initializers","class_name":"RandomUniform","config":{"seed":null,"minval":-0.05,"maxval":0.05},"registered_name":null},"embeddings_regularizer":null,"activity_regularizer":null,"embeddings_constraint":null,"mask_zero":false},"name":"genre_embedding","inbound_nodes":[[["genre_input",0,0,{}]]]},{"class_name":"Embedding","config":{"name":"mood_embedding","trainable":true,"dtype":{"module":"keras","class_name":"DTypePolicy","config":{"name":"float32"},"registered_name":null},"input_dim":27,"output_dim":16,"embeddings_initializer":{"module":"keras.initializers","class_name":"RandomUniform","config":{"seed":null,"minval":-0.05,"maxval":0.05},"registered_name":null},"embeddings_regularizer":null,"activity_regularizer":null,"embeddings_constraint":null,"mask_zero":false},"name":"mood_embedding","inbound_nodes":[[["mood_input",0,0,{}]]]},{"class_name":"Embedding","config":{"name":"key_embedding","trainable":true,"dtype":{"module":"keras","class_name":"DTypePolicy","config":{"name":"float32"},"registered_name":null},"input_dim":24,"output_dim":12,"embeddings_initializer":{"module":"keras.initializers","class_name":"RandomUniform","config":{"seed":null,"minval":-0.05,"maxval":0.05},"registered_name":null},"embeddings_regularizer":null,"activity_regularizer":null,"embeddings_constraint":null,"mask_zero":false},"name":"key_embedding","inbound_nodes":[[["key_input",0,0,{}]]]},{"class_name":"Embedding","config":{"name":"scale_embedding","trainable":true,"dtype":{"module":"keras","class_name":"DTypePolicy","config":{"name":"float32"},"registered_name":null},"input_dim":2,"output_dim":4,"embeddings_initializer":{"module":"keras.initializers","class_name":"RandomUniform","config":{"seed":null,"minval":-0.05,"maxval":0.05},"registered_name":null},"embeddings_regularizer":null,"activity_regularizer":null,"embeddings_constraint":null,"mask_zero":false},"name":"scale_embedding","inbound_nodes":[[["scale_type_input",0,0,{}]]]},{"class_name":"Flatten","config":{"name":"flatten_4","trainable":true,"dtype":{"module":"keras","class_name":"DTypePolicy","config":{"name":"float32"},"registered_name":null},"data_format":"channels_last"},"name":"flatten_4","inbound_nodes":[[["genre_embedding",0,0,{}]]]},{"class_name":"Flatten","config":{"name":"flatten_5","trainable":true,"dtype":{"module":"keras","class_name":"DTypePolicy","config":{"name":"float32"},"registered_name":null},"data_format":"channels_last"},"name":"flatten_5","inbound_nodes":[[["mood_embedding",0,0,{}]]]},{"class_name":"Flatten","config":{"name":"flatten_6","trainable":true,"dtype":{"module":"keras","class_name":"DTypePolicy","config":{"name":"float32"},"registered_name":null},"data_format":"channels_last"},"name":"flatten_6","inbound_nodes":[[["key_embedding",0,0,{}]]]},{"class_name":"Flatten","config":{"name":"flatten_7","trainable":true,"dtype":{"module":"keras","class_name":"DTypePolicy","config":{"name":"float32"},"registered_name":null},"data_format":"channels_last"},"name":"flatten_7","inbound_nodes":[[["scale_embedding",0,0,{}]]]},{"class_name":"Concatenate","config":{"name":"conditioning_concat","trainable":true,"dtype":{"module":"keras","class_name":"DTypePolicy","config":{"name":"float32"},"registered_name":null},"axis":-1},"name":"conditioning_concat","inbound_nodes":[[["flatten_4",0,0,{}],["flatten_5",0,0,{}],["flatten_6",0,0,{}],["flatten_7",0,0,{}]]]},{"class_name":"InputLayer","config":{"dtype":"int32","sparse":false,"ragged":false,"name":"chord_sequence_input","inputShape":[12]},"name":"chord_sequence_input","inbound_nodes":[]},{"class_name":"Dense","config":{"name":"conditioning_projection","trainable":true,"dtype":{"module":"keras","class_name":"DTypePolicy","config":{"name":"float32"},"registered_name":null},"units":128,"activation":"relu","use_bias":true,"kernel_initializer":{"module":"keras.initializers","class_name":"GlorotUniform","config":{"seed":null},"registered_name":null},"bias_initializer":{"module":"keras.initializers","class_name":"Zeros","config":{},"registered_name":null},"kernel_regularizer":null,"bias_regularizer":null,"kernel_constraint":null,"bias_constraint":null},"name":"conditioning_projection","inbound_nodes":[[["conditioning_concat",0,0,{}]]]},{"class_name":"Embedding","config":{"name":"chord_embedding","trainable":true,"dtype":{"module":"keras","class_name":"DTypePolicy","config":{"name":"float32"},"registered_name":null},"input_dim":279,"output_dim":128,"embeddings_initializer":{"module":"keras.initializers","class_name":"RandomUniform","config":{"seed":null,"minval":-0.05,"maxval":0.05},"registered_name":null},"embeddings_regularizer":null,"activity_regularizer":null,"embeddings_constraint":null,"mask_zero":false},"name":"chord_embedding","inbound_nodes":[[["chord_sequence_input",0,0,{}]]]},{"class_name":"RepeatVector","config":{"name":"conditioning_repeat","trainable":true,"dtype":{"module":"keras","class_name":"DTypePolicy","config":{"name":"float32"},"registered_name":null},"n":12},"name":"conditioning_repeat","inbound_nodes":[[["conditioning_projection",0,0,{}]]]},{"class_name":"Concatenate","config":{"name":"combine_inputs","trainable":true,"dtype":{"module":"keras","class_name":"DTypePolicy","config":{"name":"float32"},"registered_name":null},"axis":-1},"name":"combine_inputs","inbound_nodes":[[["chord_embedding",0,0,{}],["conditioning_repeat",0,0,{}]]]},{"class_name":"LSTM","config":{"name":"lstm_layer_1","trainable":true,"dtype":{"module":"keras","class_name":"DTypePolicy","config":{"name":"float32"},"registered_name":null},"return_sequences":true,"return_state":false,"go_backwards":false,"stateful":false,"unroll":false,"zero_output_for_mask":false,"units":256,"activation":"tanh","recurrent_activation":"sigmoid","use_bias":true,"kernel_initializer":{"module":"keras.initializers","class_name":"GlorotUniform","config":{"seed":null},"registered_name":null},"recurrent_initializer":{"module":"keras.initializers","class_name":"Orthogonal","config":{"seed":null,"gain":1.0},"registered_name":null},"bias_initializer":{"module":"keras.initializers","class_name":"Zeros","config":{},"registered_name":null},"unit_forget_bias":true,"kernel_regularizer":null,"recurrent_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"recurrent_constraint":null,"bias_constraint":null,"dropout":0.0,"recurrent_dropout":0.0,"seed":null},"name":"lstm_layer_1","inbound_nodes":[[["combine_inputs",0,0,{"training":false,"mask":null}]]]},{"class_name":"Dropout","config":{"name":"dropout_1","trainable":true,"dtype":{"module":"keras","class_name":"DTypePolicy","config":{"name":"float32"},"registered_name":null},"rate":0.3,"seed":null,"noise_shape":null},"name":"dropout_1","inbound_nodes":[[["lstm_layer_1",0,0,{"training":false}]]]},{"class_name":"LSTM","config":{"name":"lstm_layer_2","trainable":true,"dtype":{"module":"keras","class_name":"DTypePolicy","config":{"name":"float32"},"registered_name":null},"return_sequences":true,"return_state":false,"go_backwards":false,"stateful":false,"unroll":false,"zero_output_for_mask":false,"units":256,"activation":"tanh","recurrent_activation":"sigmoid","use_bias":true,"kernel_initializer":{"module":"keras.initializers","class_name":"GlorotUniform","config":{"seed":null},"registered_name":null},"recurrent_initializer":{"module":"keras.initializers","class_name":"Orthogonal","config":{"seed":null,"gain":1.0},"registered_name":null},"bias_initializer":{"module":"keras.initializers","class_name":"Zeros","config":{},"registered_name":null},"unit_forget_bias":true,"kernel_regularizer":null,"recurrent_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"recurrent_constraint":null,"bias_constraint":null,"dropout":0.0,"recurrent_dropout":0.0,"seed":null},"name":"lstm_layer_2","inbound_nodes":[[["dropout_1",0,0,{"training":false,"mask":null}]]]},{"class_name":"Dropout","config":{"name":"dropout_2","trainable":true,"dtype":{"module":"keras","class_name":"DTypePolicy","config":{"name":"float32"},"registered_name":null},"rate":0.3,"seed":null,"noise_shape":null},"name":"dropout_2","inbound_nodes":[[["lstm_layer_2",0,0,{"training":false}]]]},{"class_name":"TimeDistributed","config":{"name":"output_layer","trainable":true,"dtype":{"module":"keras","class_name":"DTypePolicy","config":{"name":"float32"},"registered_name":null},"layer":{"module":"keras.layers","class_name":"Dense","config":{"name":"dense_1","trainable":true,"dtype":{"module":"keras","class_name":"DTypePolicy","config":{"name":"float32"},"registered_name":null},"units":279,"activation":"softmax","use_bias":true,"kernel_initializer":{"module":"keras.initializers","class_name":"GlorotUniform","config":{"seed":null},"registered_name":null},"bias_initializer":{"module":"keras.initializers","class_name":"Zeros","config":{},"registered_name":null},"kernel_regularizer":null,"bias_regularizer":null,"kernel_constraint":null,"bias_constraint":null},"registered_name":null,"build_config":{"input_shape":[null,256]}}},"name":"output_layer","inbound_nodes":[[["dropout_2",0,0,{"mask":null}]]]}],"input_layers":[["chord_sequence_input",0,0],["genre_input",0,0],["mood_input",0,0],["key_input",0,0],["scale_type_input",0,0]],"output_layers":[["output_layer",0,0]]}},"training_config":{"loss":"sparse_categorical_crossentropy","loss_weights":null,"metrics":["accuracy"],"weighted_metrics":null,"run_eagerly":false,"steps_per_execution":1,"jit_compile":false,"optimizer_config":{"class_name":"Adam","config":{"name":"adam","learning_rate":0.0010000000474974513,"weight_decay":null,"clipnorm":null,"global_clipnorm":null,"clipvalue":null,"use_ema":false,"ema_momentum":0.99,"ema_overwrite_frequency":null,"loss_scale_factor":null,"gradient_accumulation_steps":null,"beta_1":0.9,"beta_2":0.999,"epsilon":1e-07,"amsgrad":false}}}},"weightsManifest":[{"paths":["group1-shard1of2.bin","group1-shard2of2.bin"],"weights":[{"name":"chord_embedding/embeddings","shape":[279,128],"dtype":"float32"},{"name":"conditioning_projection/kernel","shape":[48,128],"dtype":"float32"},{"name":"conditioning_projection/bias","shape":[128],"dtype":"float32"},{"name":"genre_embedding/embeddings","shape":[8,16],"dtype":"float32"},{"name":"key_embedding/embeddings","shape":[24,12],"dtype":"float32"},{"name":"lstm_layer_1/lstm_cell/kernel","shape":[256,1024],"dtype":"float32"},{"name":"lstm_layer_1/lstm_cell/recurrent_kernel","shape":[256,1024],"dtype":"float32"},{"name":"lstm_layer_1/lstm_cell/bias","shape":[1024],"dtype":"float32"},{"name":"lstm_layer_2/lstm_cell/kernel","shape":[256,1024],"dtype":"float32"},{"name":"lstm_layer_2/lstm_cell/recurrent_kernel","shape":[256,1024],"dtype":"float32"},{"name":"lstm_layer_2/lstm_cell/bias","shape":[1024],"dtype":"float32"},{"name":"mood_embedding/embeddings","shape":[27,16],"dtype":"float32"},{"name":"output_layer/dense_1/kernel","shape":[256,279],"dtype":"float32"},{"name":"output_layer/dense_1/bias","shape":[279],"dtype":"float32"},{"name":"scale_embedding/embeddings","shape":[2,4],"dtype":"float32"}]}]}